# Before you start :
   - These exercises are related to the Subsetting and Descriptive Stats lessons.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in the `your-code` folder of this lab.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly enjoy the process!!!

#### Import all the libraries that are necessary

In [1]:
# import libraries here
import pandas
import numpy
import matplotlib
from scipy.stats import norm
import matplotlib.pyplot as plt

# Challenge 1

#### In this challenge we will use the `Temp_States.csv` file. 

#### First import it into a data frame called `temp`.

In [ ]:
# your answer here
temp = pandas.read_csv('Temp_States.csv')

#### Print `temp`

In [ ]:
temp

#### Explore the data types of the Temp dataframe. What type of data do we have? Comment your result.

In [ ]:
# your answer here
temp.index.values

#Numpy array

#### Select the rows where state is New York

In [ ]:
# your answer here
temp[:3]

#### What is the average of the temperature of cities in New York?

In [ ]:
# your answer here
temp[:3].mean()

#### We want to know cities and states with Temperature above 15 degress Celcius

In [ ]:
# your answer here
temp[temp.Temperature >15]

#### Now, return only the cities that have a temperature above 15 degress Celcius

In [ ]:
# your answer here
temp[temp.Temperature > 15]['City']

#### We want to know which cities have a temperature above 15 degrees Celcius and below 20 degrees Celcius

*Hint: First write the condition then select the rows.*

In [ ]:
# your answer here
temp[(temp.Temperature > 15)&(temp.Temperature < 20)]

#### Find the mean and the standard deviation of the temperature of each state.

*Hint: Use functions from Data Manipulation lesson*

In [ ]:
# your answer here
temp.groupby(['State'])['Temperature'].agg(['mean','median','std'])

# Challenge 2

#### Load the `employee.csv` file into a DataFrame. Call the dataframe `employee`

In [ ]:
# your answer here

employee = pandas.read_csv('employee.csv')

#### Explore the data types of the Temp dataframe. Comment your results

In [ ]:
# your answer here
employee.dtypes

#5 objetos y dos ints

#### Show visually the frequency distribution (histogram) of the employee dataset. In few words describe these histograms?

In [ ]:
# your answer here
employee.hist()
#La mayoría de los empleados tienen 3 años en la empresa y ganan menos de 40k

#### What's the average salary in this company?

In [ ]:
# your answer here

employee.mean()

#### What's the highest salary?

In [ ]:
# your answer here
employee.max()
employee.Salary.max()

#### What's the lowest salary?

In [ ]:
# your answer here
employee.min()
employee.Salary.min()

#### Who are the employees with the lowest salary?

In [ ]:
# your answer here
employee[(employee.Salary < 40)]

#### Could you give all the information about an employee called David?

In [ ]:
# your answer here
employee[employee.Name == 'David']

#### Could you give only David's salary?

In [ ]:
# your answer here
employee[employee.Name == 'David']['Salary']

#### Print all the rows where job title is associate

In [ ]:
# your answer here

employee[employee.Title == 'associate']

#### Print the first 3 rows of your dataframe

##### Tip : There are 2 ways to do it. Do it both ways

In [ ]:
# your answer here- 1 method
employee[:3]

In [ ]:
# your answer here- 2nd method
employee[:-6]

#### Find the employees who's title is associate and the salary above 55?

In [ ]:
# your answer here
employee[(employee.Title == 'associate')&(employee.Salary > 55)]

#### Group the employees based on their number of years of employment. What are the average salaries in each group?

In [ ]:
# your answer here
employee.groupby(['Years'])['Salary'].mean()

####  What is the average Salary per title?

In [ ]:
# your answer here
employee.groupby(['Title'])['Salary'].mean()

#### Show a visual summary of the data using boxplot. What Are the First and Third Quartiles? Comment your results.
##### * Hint : Quantiles vs Quartiles*
##### - `In Probability and Statistics, quantiles are cut points dividing the range of a probability distribution into continuous intervals with equal probabilities. When division is into four parts the values of the variate corresponding to 25%, 50% and 75% of the total distribution are called quartiles.`

In [ ]:
# draw boxplot here
%matplotlib inline
employee.boxplot()

In [ ]:
# print first quartile here
employee.quantile(.25)

In [ ]:
# print third quartile here
employee.quantile(.75)

#### Is the mean salary per gender different?

In [ ]:
# your answer here
employee.groupby(['Gender'])['Salary'].mean()

#### Find the minimum, mean and the maximum of all numeric columns for each Department.

##### Hint: Use functions from Data Manipulation lesson

In [ ]:
# your answer here
employee.groupby(['Department'])['Salary', 'Years'].agg(['mean','max','min'])

### Bonus Question

#### For each department, compute the difference between the maximal salary and the minimal salary.

##### * Hint: try using `agg` or `apply` and `lambda`*

In [ ]:
# your answer here

compare = lambda(a, b): a[Salary.max()] - b[Salary.min()]

employee.groupby(['Department'])['Salary'].agg(compare)

# Challenge 3

#### Open the Orders.csv dataset. Name your dataset orders

In [2]:
# your answer here
orders = pandas.read_csv('Orders.csv')

#### Explore your dataset by looking at the data types and the summary statistics. Comment your results

In [3]:
# your answer here
orders.dtypes

Unnamed: 0        int64
InvoiceNo         int64
StockCode        object
year              int64
month             int64
day               int64
hour              int64
Description      object
Quantity          int64
InvoiceDate      object
UnitPrice       float64
CustomerID        int64
Country          object
amount_spent    float64
dtype: object

In [5]:
# your answer here
orders.describe()

,Unnamed: 0,InvoiceNo,year,month,day,hour,Quantity,UnitPrice,CustomerID,amount_spent
count,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000,397924.000000
mean,278465.221859,560617.126645,2010.934259,7.612537,3.614555,12.728247,13.021823,3.116174,15294.315171,22.394749
std,152771.368303,13106.167695,0.247829,3.416527,1.928274,2.273535,180.420210,22.096788,1713.169877,309.055588
min,0.000000,536365.000000,2010.000000,1.000000,1.000000,6.000000,1.000000,0.000000,12346.000000,0.000000
25%,148333.750000,549234.000000,2011.000000,5.000000,2.000000,11.000000,2.000000,1.250000,13969.000000,4.680000
50%,284907.500000,561893.000000,2011.000000,8.000000,3.000000,13.000000,6.000000,1.950000,15159.000000,11.800000
75%,410079.250000,572090.000000,2011.000000,11.000000,5.000000,14.000000,12.000000,3.750000,16795.000000,19.800000
max,541908.000000,581587.000000,2011.000000,12.000000,7.000000,20.000000,80995.000000,8142.750000,18287.000000,168469.600000

####  What is the average Purchase Price?

In [7]:
# your answer here

orders.amount_spent.mean()

22.39474850474768

#### What were the highest and lowest purchase prices?

In [9]:
# your answer here
orders.amount_spent.min()

0.0

In [10]:
# your answer here
orders.amount_spent.max()

168469.6

#### Select all the customers we have in Spain

In [11]:
# your answer here
orders[orders.Country == 'Spain']

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
4250,6421,536944,22383,2010,12,5,12,lunch bag suki design,70,2010-12-03 12:20:00,1.65,12557,Spain,115.50
4251,6422,536944,22384,2010,12,5,12,lunch bag pink polkadot,100,2010-12-03 12:20:00,1.45,12557,Spain,145.00
4252,6423,536944,20727,2010,12,5,12,lunch bag black skull.,60,2010-12-03 12:20:00,1.65,12557,Spain,99.00
4253,6424,536944,20725,2010,12,5,12,lunch bag red retrospot,70,2010-12-03 12:20:00,1.65,12557,Spain,115.50
4254,6425,536944,20728,2010,12,5,12,lunch bag cars blue,100,2010-12-03 12:20:00,1.45,12557,Spain,145.00
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
394733,535271,581193,23291,2011,12,3,17,dolly girl childrens cup,2,2011-12-07 17:05:00,1.25,17097,Spain,2.50
394734,535272,581193,85232D,2011,12,3,17,set/3 decoupage stacking tins,1,2011-12-07 17:05:00,4.95,17097,Spain,4.95
394735,535273,581193,22721,2011,12,3,17,set of 3 cake tins sketchbook,2,2011-12-07 17:05:00,1.95,17097,Spain,3.90
394736,535274,581193,23241,2011,12,3,17,treasure tin gymkhana design,1,2011-12-07 17:05:00,2.08,17097,Spain,2.08
394737,535275,581193,23247,2011,12,3,17,biscuit tin 50's christmas,1,2011-12-07 17:05:00,2.89,17097,Spain,2.89

#### How many customers do we have in Spain?
##### Hint : Use value_counts()

In [17]:
# your answer here

orders[orders.Country == 'Spain']['CustomerID'].count()

2485

#### Select all the customers who have bought more than 50 items ?

In [35]:
# your answer here
orders[orders.Quantity > 50][['CustomerID', 'Quantity']]

        CustomerID  Quantity
46           13748        80
83           15291        64
96           14688       120
102          14688        96
174          16029       100
...            ...       ...
397720       18102       144
397721       16626        84
397729       16626       144
397761       15311        96
397882       13777        72

[11609 rows x 2 columns]

#### Select orders from Spain that are above 50 items

In [36]:
# your answer here
orders[(orders.Country == 'Spain')&(orders.Quantity > 50)][['Country','Quantity','CustomerID']]

       Country  Quantity  CustomerID
4250     Spain        70       12557
4251     Spain       100       12557
4252     Spain        60       12557
4253     Spain        70       12557
4254     Spain       100       12557
32454    Spain       144       12557
32455    Spain       360       12557
32456    Spain       360       12557
32457    Spain       144       12557
91155    Spain       150       12557
91156    Spain       150       12557
91159    Spain       150       12557
174442   Spain       100       12557
174443   Spain       100       12557
174444   Spain       100       12557
174445   Spain       100       12557
174446   Spain        72       12557
174447   Spain       360       12557
174448   Spain       360       12557
174449   Spain        72       12557
197167   Spain       128       12507
197168   Spain       144       12507
197169   Spain       128       12507
197170   Spain       128       12507
197171   Spain       128       12507
224881   Spain        60       12484
254097   Spain        96       12546
289129   Spain        72       12454
289134   Spain        72       12454
289142   Spain       200       12454
289143   Spain       288       12454
295956   Spain        96       12596
312655   Spain        72       12597
312656   Spain        72       12597
312657   Spain        72       12597
366326   Spain       200       12557
366327   Spain        72       12557
366328   Spain       360       12557
366329   Spain       288       12557

#### Select all free orders

In [37]:
# your answer here
orders[orders.amount_spent == 0][['InvoiceNo','amount_spent']]

        InvoiceNo  amount_spent
6914       537197           0.0
22539      539263           0.0
25379      539722           0.0
29080      540372           0.0
29082      540372           0.0
34494      541109           0.0
53788      543599           0.0
85671      547417           0.0
92875      548318           0.0
97430      548871           0.0
107192     550188           0.0
128641     553000           0.0
137127     554037           0.0
194648     561284           0.0
197173     561669           0.0
199711     561916           0.0
208950     562973           0.0
223931     564651           0.0
223932     564651           0.0
223933     564651           0.0
223934     564651           0.0
256263     568158           0.0
259399     568384           0.0
273926     569716           0.0
286507     571035           0.0
307092     572893           0.0
319882     574138           0.0
320049     574175           0.0
320407     574252           0.0
322279     574469           0.0
328385     574879           0.0
329006     574920           0.0
329007     574920           0.0
334242     575579           0.0
334243     575579           0.0
352746     577129           0.0
353097     577168           0.0
354170     577314           0.0
358629     577696           0.0
370473     578841           0.0

### Select all orders that are 'lunch bag'
#### Hint: Use string functions

In [39]:
# your answer here
orders[orders.Description.str.contains('lunch bag')]

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
93,93,536378,20725,2010,12,3,9,lunch bag red retrospot,10,2010-12-01 09:37:00,1.65,14688,United Kingdom,16.50
172,174,536385,22662,2010,12,3,9,lunch bag dolly girl design,10,2010-12-01 09:56:00,1.65,17420,United Kingdom,16.50
354,363,536401,22662,2010,12,3,11,lunch bag dolly girl design,1,2010-12-01 11:21:00,1.65,15862,United Kingdom,1.65
359,368,536401,20725,2010,12,3,11,lunch bag red retrospot,1,2010-12-01 11:21:00,1.65,15862,United Kingdom,1.65
360,369,536401,22382,2010,12,3,11,lunch bag spaceboy design,2,2010-12-01 11:21:00,1.65,15862,United Kingdom,3.30
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
397465,540436,581486,23207,2011,12,5,9,lunch bag alphabet design,10,2011-12-09 09:38:00,1.65,17001,United Kingdom,16.50
397713,541695,581538,20727,2011,12,5,11,lunch bag black skull.,1,2011-12-09 11:34:00,1.65,14446,United Kingdom,1.65
397714,541696,581538,20725,2011,12,5,11,lunch bag red retrospot,1,2011-12-09 11:34:00,1.65,14446,United Kingdom,1.65
397877,541862,581581,23681,2011,12,5,12,lunch bag red vintage doily,10,2011-12-09 12:20:00,1.65,17581,United Kingdom,16.50
397880,541865,581583,20725,2011,12,5,12,lunch bag red retrospot,40,2011-12-09 12:23:00,1.45,13777,United Kingdom,58.00

#### Select all orders that are made in 2011 and are 'lunch bag'

In [60]:
# your answer here
#orders[orders.year == '2011']&[orders.Description.str.contains('lunch bag')]

orders[orders.Description.str.contains('lunch bag')]&[orders.year == 2011]['Description','year']

#PREGUNTAR A BRISA

TypeError: list indices must be integers or slices, not tuple

#### Show the frequency distribution of the amount spent in Spain.

In [ ]:
# your answer here

#### Select all orders made in the month of August

In [ ]:
# your answer here

#### Select how many orders are made by countries in the month of August
##### Hint: Use value_counts()

In [ ]:
# your answer here

#### What's the  average amount of money spent by country

In [ ]:
# your answer here

#### What's the most expensive item?

In [ ]:
# your answer here

#### What was the average amount spent per year ?

In [ ]:
# your answer here